In [8]:
import numpy as np

In [9]:
import pandas as pd

In [10]:
#series is different from np array by the fact that a series can have labeled indexes

In [12]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [15]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [18]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [23]:
#series can hold pretty much any type of obect

In [24]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [25]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [26]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [27]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [28]:
ser1['USA']

1

In [29]:
ser1 + ser2 #integers get converted uinto floating point numbers

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [30]:
from numpy.random import randn

In [31]:
np.random.seed(101) #seed sets a random number

In [33]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #(data,labels,columns)

In [34]:
df #bunch of series that share an index

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [35]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [36]:
type(df['W'])

pandas.core.series.Series

In [37]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [40]:
df['New'] = df['W'] + df['Y']

In [41]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [46]:
df.drop('New',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [48]:
df.drop('New',axis=1,inplace=True)

In [49]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [50]:
df.drop('A',axis=0)

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
df.drop('A',axis=0,inplace=True)

In [53]:
df

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [57]:
df.loc['B'] #grab a row

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [58]:
# all rows and columns are series

In [62]:
df.iloc[1] #grab a row by index

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [63]:
df.loc['B','Y'] #for specifc cells

0.16690463609281317

In [65]:
df.loc[['B','C'],['X','Y']]

          X         Y
B  0.390528  0.166905
C  0.072960  0.638787

In [66]:
df>0

       W      X      Y     Z
B  False   True   True  True
C   True   True   True  True
D  False  False  False  True
E  False   True   True  True

In [67]:
df[df>0]

          W         X         Y         Z
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [68]:
df[df['W']>0]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [72]:
df['W']>0

B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [70]:
df[df['W']>0]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [75]:
df[df['X']<0]

          W        X         Y         Z
D -0.497104 -0.75407 -0.943406  0.484752

In [76]:
df

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [78]:
df[df['W']<0]['Y']  #stacking of steps in one line

B    0.166905
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [79]:
df[df['W']<0][['Y','X']]

          Y         X
B  0.166905  0.390528
D -0.943406 -0.754070
E  0.238127  1.901755

In [80]:
df

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [82]:
#multiple conditions
df[(df['W']>0) | (df['Y']>0)]  #python bool cannot take a series of booleean values

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [83]:
df[(df['W']>0) & (df['Y']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [84]:
df

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [85]:
df.reset_index() #does not occur inplace

  index         W         X         Y         Z
0     B -0.134841  0.390528  0.166905  0.184502
1     C  0.807706  0.072960  0.638787  0.329646
2     D -0.497104 -0.754070 -0.943406  0.484752
3     E -0.116773  1.901755  0.238127  1.996652

In [89]:
newind = 'CA WA NY OR'.split()  #.split() is method for creating a list

In [90]:
newind

['CA', 'WA', 'NY', 'OR']

In [91]:
df['States'] = newind

In [92]:
df

          W         X         Y         Z States
B -0.134841  0.390528  0.166905  0.184502     CA
C  0.807706  0.072960  0.638787  0.329646     WA
D -0.497104 -0.754070 -0.943406  0.484752     NY
E -0.116773  1.901755  0.238127  1.996652     OR

In [93]:
df.set_index('States') #inplace is false

               W         X         Y         Z
States
CA     -0.134841  0.390528  0.166905  0.184502
WA      0.807706  0.072960  0.638787  0.329646
NY     -0.497104 -0.754070 -0.943406  0.484752
OR     -0.116773  1.901755  0.238127  1.996652

In [95]:
df

          W         X         Y         Z States
B -0.134841  0.390528  0.166905  0.184502     CA
C  0.807706  0.072960  0.638787  0.329646     WA
D -0.497104 -0.754070 -0.943406  0.484752     NY
E -0.116773  1.901755  0.238127  1.996652     OR

In [97]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #makes a list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [98]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [99]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [100]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [101]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [102]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [103]:
df.index.names = ['Groups','Numbers']

In [104]:
df

                       A         B
Groups Numbers
G1     1       -0.993263  0.196800
       2       -1.136645  0.000366
       3        1.025984 -0.156598
G2     1       -0.031579  0.649826
       2        2.154846 -0.610259
       3       -0.755325 -0.346419

In [110]:
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [111]:
df

                       A         B
Groups Numbers
G1     1       -0.993263  0.196800
       2       -1.136645  0.000366
       3        1.025984 -0.156598
G2     1       -0.031579  0.649826
       2        2.154846 -0.610259
       3       -0.755325 -0.346419

In [115]:
df.xs(1,level='Numbers') #cross section method skips some syntax and is more useful

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

In [117]:
d = {'A': [1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [119]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [120]:
df.dropna() #pandas drops any single row with one or more missing values

     A    B  C
0  1.0  5.0  1

In [121]:
df.dropna(axis=1) #pandas drops any single column with one or more missing values

   C
0  1
1  2
2  3

In [122]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [123]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [124]:
df.fillna(value='Fill value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill value  2
2  Fill value  Fill value  3

In [125]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [127]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [129]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [130]:
df = pd.DataFrame(data)

In [131]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [135]:
byComp = df.groupby('Company')
byComp

In [136]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [137]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [139]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [140]:
byComp.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [142]:
df.groupby('Company').count().loc['FB']

Person    2
Sales     2
Name: FB, dtype: int64

In [145]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [151]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [154]:
df['col2'].nunique()

3

In [156]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [157]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [158]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [159]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [160]:
def times2(x):
    return x*2

In [164]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [165]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [166]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [167]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [168]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [171]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [172]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [173]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [175]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [176]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [178]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [179]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [181]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [2]:
!pip install lxml

Collecting lxml
  Downloading lxml-4.9.2.tar.gz (3.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.7/3.7 MB 2.1 MB/s eta 0:00:00a 0:00:01
  Preparing metadata (setup.py) ... done
Using legacy 'setup.py install' for lxml, since package 'wheel' is not installed.
Installing collected packages: lxml
  Running setup.py install for lxml ... done
Successfully installed lxml-4.9.2
WARNING: You are using pip version 22.0.4; however, version 23.1.2 is available.
You should consider upgrading via the '/Users/ammoa380/.pyenv/versions/3.7.16/bin/python3.7 -m pip install --upgrade pip' command.

In [3]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 112.2/112.2 KB 53.6 kB/s eta 0:00:00a 0:00:01
Collecting webencodings
  Using cached webencodings-0.5.1-py2.py3-none-any.whl (11 kB)
Requirement already satisfied: six>=1.9 in /Users/ammoa380/.pyenv/versions/3.7.16/lib/python3.7/site-packages (from html5lib) (1.16.0)
Installing collected packages: webencodings, html5lib
Successfully installed html5lib-1.1 webencodings-0.5.1
WARNING: You are using pip version 22.0.4; however, version 23.1.2 is available.
You should consider upgrading via the '/Users/ammoa380/.pyenv/versions/3.7.16/bin/python3.7 -m pip install --upgrade pip' command.

In [4]:
!pip install BeautifulSoup4

Collecting BeautifulSoup4
  Using cached beautifulsoup4-4.12.2-py3-none-any.whl (142 kB)
Collecting soupsieve>1.2
  Downloading soupsieve-2.4.1-py3-none-any.whl (36 kB)
Installing collected packages: soupsieve, BeautifulSoup4
Successfully installed BeautifulSoup4-4.12.2 soupsieve-2.4.1
WARNING: You are using pip version 22.0.4; however, version 23.1.2 is available.
You should consider upgrading via the '/Users/ammoa380/.pyenv/versions/3.7.16/bin/python3.7 -m pip install --upgrade pip' command.

In [5]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.15-py3-none-any.whl (1.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.8/1.8 MB 34.5 kB/s eta 0:00:0000:0100:02m
Collecting importlib-metadata
  Downloading importlib_metadata-6.6.0-py3-none-any.whl (22 kB)
Collecting typing-extensions>=4.2.0
  Downloading typing_extensions-4.6.3-py3-none-any.whl (31 kB)
Collecting zipp>=0.5
  Using cached zipp-3.15.0-py3-none-any.whl (6.8 kB)
Installing collected packages: zipp, typing-extensions, importlib-metadata, sqlalchemy
Successfully installed importlib-metadata-6.6.0 sqlalchemy-2.0.15 typing-extensions-4.6.3 zipp-3.15.0
WARNING: You are using pip version 22.0.4; however, version 23.1.2 is available.
You should consider upgrading via the '/Users/ammoa380/.pyenv/versions/3.7.16/bin/python3.7 -m pip install --upgrade pip' command.

In [6]:
pwd

'/Users/ammoa380/Documents/ML and DS'

In [11]:
df = pd.read_csv('example')

In [14]:
df.to_csv('My Output',index=False)

In [15]:
pd.read_csv('My Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 KB 1.5 MB/s eta 0:00:00a 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
WARNING: You are using pip version 22.0.4; however, version 23.1.2 is available.
You should consider upgrading via the '/Users/ammoa380/.pyenv/versions/3.7.16/bin/python3.7 -m pip install --upgrade pip' command.

In [43]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15